app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."id" ASC
SELECT 1 AS one FROM "products" LIMIT $1  [["LIMIT", 1]]
---
  def index
    json_array = []
    if Product.any?

INSERT INTO "products" ("product_name", "amount_available", "cost", "seller_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["product_name", "Kit Kat"], ["amount_available", 10], ["cost", 85], ["seller_id", 4], ["created_at", "2023-01-26 01:08:44.579099"], ["updated_at", "2023-01-26 01:08:44.579099"]]
---
  def create
    @product = Product.new(product_params)
    @product.seller = @user

    if @product.save

UPDATE "products" SET "amount_available" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["amount_available", 20], ["updated_at", "2023-01-27 01:14:10.495757"], ["id", 2]]
---
  def update
    if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]
---
  def destroy
    if @product.destroy

UPDATE "products" SET "amount_available" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["amount_available", 9], ["updated_at", "2023-01-26 01:56:42.502747"], ["id", 3]]
UPDATE "users" SET "deposit" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["deposit", 0], ["updated_at", "2023-01-26 01:56:42.509062"], ["id", 1]]
---
  def buy
    if params[:amount].to_s === params[:amount].to_i.to_s
      amount = Integer(params[:amount])
      total_value = amount * @product.cost

      if @product.amount_available < amount
        render_error('Product requested doesn\'t have enough quantity.')
      elsif total_value > @user.deposit
        render_error('The product value is too high for your purchase.')
      else
        new_amount = @product.amount_available - amount
        @product.update(amount_available: new_amount)
        change = @user.deposit - total_value
        @user.update(deposit: 0)

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def set_product
    product_id = params[:id] || params[:product_id]
    @product = Product.find(product_id)