app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "john_hardesky"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."username" = $1 AND ("users"."id" != $2) LIMIT $3  [["username", "john_hardesky"], ["id", 2], ["LIMIT", 1]]
---
  def create
    user = User.validate_login(params[:username], params[:password])
    if user && user.errors.empty?

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "mingos"], ["LIMIT", 1]]
---
  def destroy
    current_user = User.validate_login(params[:username], params[:password])
    if current_user.auth_token.present?