app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("username", "password_digest", "email", "name", "role", "auth_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def index
        json_array = []
        if User.any?
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC
SELECT 1 AS one FROM "users" LIMIT $1  [["LIMIT", 1]]

    def update
        @user.assign_attributes(user_params)
        if @user.save
---
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "mingos12345678@mail.com"], ["updated_at", "2023-01-27 00:00:44.205962"], ["id", 1]]

    def destroy
        user_to_destroy = User.find_by_id(params[:id])
        if user_to_destroy&.id != @user.id
            if user_to_destroy.present?
                if user_to_destroy.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]

    def deposit
        deposit = params[:deposit]
        if deposit.to_s === deposit.to_i.to_s && CoinsToUse.include?(deposit.to_i)
            deposit = deposit.to_i
            @user.deposit += deposit
            @user.save
---
UPDATE "users" SET "deposit" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["deposit", 5], ["updated_at", "2023-01-25 19:16:08.636577"], ["id", 1]]

    def reset
        old_deposit = @user.deposit
        if old_deposit.zero?
            render_unauthorized("You don\'t have any deposit in your profile.")
        else
            coins_change = get_change_in_coins(@user.deposit)
            @user.update(deposit: 0)
---
UPDATE "users" SET "deposit" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["deposit", 0], ["updated_at", "2023-01-25 19:27:56.525146"], ["id", 1]]