app/controllers/users_controller.rb

    def profile
        user = User.find_by_auth_token!(request.headers[:token])
---
SELECT "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "Mw56sQhiUnCNJcwE645ABRhy"], ["LIMIT", 1]]